; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-79)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 - object)
 (:init 
    (arm-empty)
    (clear b21)
    (on b21 b10)
    (on b10 b20)
    (on b20 b3)
    (on b3 b15)
    (on b15 b14)
    (on b14 b11)
    (on b11 b5)
    (on b5 b12)
    (on b12 b7)
    (on b7 b6)
    (on b6 b8)
    (on b8 b4)
    (on b4 b19)
    (on b19 b13)
    (on-table b13)
    (clear b9)
    (on b9 b2)
    (on b2 b22)
    (on b22 b17)
    (on b17 b18)
    (on b18 b1)
    (on b1 b16)
    (on b16 b23)
    (on-table b23))
 (:goal (and 
(on b20 b10)
))
)

; plan
1. (unstack b21 b10)
   deleted: (on b21 b10) (clear b21) (arm-empty)
   added: (holding b21) (clear b10)
   goals met: 0 of 1
2. (putdown b21)
   deleted: (holding b21)
   added: (clear b21) (arm-empty) (on-table b21)
   goals met: 0 of 1
3. (unstack b10 b20)
   deleted: (on b10 b20) (clear b10) (arm-empty)
   added: (holding b10) (clear b20)
   goals met: 0 of 1
4. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 0 of 1
5. (unstack b20 b3)
   deleted: (on b20 b3) (clear b20) (arm-empty)
   added: (holding b20) (clear b3)
   goals met: 0 of 1
6. (stack b20 b10)
   deleted: (clear b10) (holding b20)
   added: (arm-empty) (clear b20) (on b20 b10)
   goals met: 1 of 1
